## Production: terraform
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                      NAME                       |
|----------|-------------------------------------------------|
| add      | `aws_ssm_parameter.gcp_sre_service_account_key` |
| update   | `aws_ecs_service.main`                          |
|          | `aws_iam_policy.sre-bot_secrets_manager`        |
| recreate | `aws_ecs_task_definition.sre-bot`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.sre-bot_secrets_manager will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sre-bot_secrets_manager" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sts:AssumeRole",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:iam::274536870005:role/sre_bot_role",
              + "arn:aws:iam::659087519042:role/sre_bot_role",
              + "arn:aws:iam::886481071419:role/sre_bot_role",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:283582579564:parameter/google_oauth_pickle_string",
              + "arn:aws:ssm:ca-central-1:283582579564:parameter/sre-bot-config",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:ca-central-1:283582579564:table/aws_access_requests",
              + "arn:aws:dynamodb:ca-central-1:283582579564:table/webhooks",
            ]
        }
    }

  # data.template_file.sre-bot will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "sre-bot" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + name             = "sre-bot"
                  + portMappings     = [
                      + {
                          + containerPort = 8000
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "PICKLE_STRING"
                          + valueFrom = "${PICKLE_STRING}"
                        },
                    ]
                  + ulimits          = [
                      + {
                          + hardLimit = 1000000
                          + name      = "nofile"
                          + softLimit = 1000000
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "GCP_SRE_SERVICE_ACCOUNT_KEY_FILE" = (known after apply)
          + "PICKLE_STRING"                    = "arn:aws:ssm:ca-central-1:283582579564:parameter/google_oauth_pickle_string"
          + "aws_region"                       = "ca-central-1"
          + "awslogs-group"                    = "/ecs/sre-bot-app"
          + "awslogs-region"                   = "ca-central-1"
          + "awslogs-stream-prefix"            = "ecs-sre-bot"
          + "fargate_cpu"                      = "256"
          + "fargate_memory"                   = "512"
          + "image"                            = "283582579564.dkr.ecr.ca-central-1.amazonaws.com/sre-bot:latest"
        }
    }

  # aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:ca-central-1:283582579564:service/sre-bot-cluster/sre-bot-service"
        name                               = "sre-bot-service"
        tags                               = {
            "CostCentre" = "sre-bot"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:283582579564:task-definition/sre-bot-task:16" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.sre-bot must be replaced
-/+ resource "aws_ecs_task_definition" "sre-bot" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:283582579564:task-definition/sre-bot-task:16" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:283582579564:task-definition/sre-bot-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "283582579564.dkr.ecr.ca-central-1.amazonaws.com/sre-bot:latest"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/sre-bot-app"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-sre-bot"
                        }
                    }
                  - mountPoints      = []
                  - name             = "sre-bot"
                  - portMappings     = [
                      - {
                          - containerPort = 8000
                          - hostPort      = 8000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "PICKLE_STRING"
                          - valueFrom = "arn:aws:ssm:ca-central-1:283582579564:parameter/google_oauth_pickle_string"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "sre-bot-task" -> (known after apply)
      ~ revision                 = 16 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_iam_policy.sre-bot_secrets_manager will be updated in-place
  ~ resource "aws_iam_policy" "sre-bot_secrets_manager" {
        id        = "arn:aws:iam::283582579564:policy/sre-botSecretsManagerKeyRetrieval"
        name      = "sre-botSecretsManagerKeyRetrieval"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::886481071419:role/sre_bot_role",
                          - "arn:aws:iam::659087519042:role/sre_bot_role",
                          - "arn:aws:iam::274536870005:role/sre_bot_role",
                        ]
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:283582579564:parameter/sre-bot-config",
                          - "arn:aws:ssm:ca-central-1:283582579564:parameter/google_oauth_pickle_string",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ca-central-1:283582579564:table/webhooks",
                          - "arn:aws:dynamodb:ca-central-1:283582579564:table/aws_access_requests",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_ssm_parameter.gcp_sre_service_account_key will be created
  + resource "aws_ssm_parameter" "gcp_sre_service_account_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "gcp_sre_service_account_key"
      + tags           = {
          + "CostCentre" = "sre-bot"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "sre-bot"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.sre_bot_bucket.aws_s3_bucket.this,
  on .terraform/modules/sre_bot_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 6 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sre-bot_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sre_bot_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sre_bot_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sre_bot_warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.aws_access_requests_table"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.sre_bot_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.webhooks_table"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.sre-bot_secrets_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.sre_bot_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.sre_bot_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_health_check.sre_bot_healthcheck"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_resolver_query_log_config.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.sre_bot_load_balancer"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid:...
```

</details>
